:PROPERTIES:
:ID:       38090D7B-B355-43C2-BBDC-95B584C01A6A
:END:
#+title: 2022-04-18
#+HUGO_SECTION:daily
#+filetags: :draft:
#+filetags: :draft:
* HI!! This Morning Rocks!
I got up so early! I twisted so many time in bed and still got up 6:14!

But time are not to be wasted! I'll have my time dedicated to seems fun to me.

And that's------AOC!
** Plan: Get good, and get better
:PROPERTIES:
:ID:       B0D9DE3C-54B5-4E69-88FA-12C276FBDFDD
:END:

*** get good
Keep me up with taught content

it's not a 1 day process, I plan to do it in 2 week.

+ the re-exposure law: all process round robined for through the week
**** PLAN Get Good                                                :agenda:
2 ways of establish and logging the plan, per-project or in one place.
I choose the =one place= way.

***** [[id:814578FE-18C2-4612-BBB9-EA33701728FB][CPT104 OS Concepts]]
****** goal
******* note wiki
A wiki all written with my own insights.
******* exported blog
******* experiance
mainly coding, interacting with the concepts I'm presented.
****** TODO Wiki Implement
******* Important: Written by Herman
It's not a matter of paraphrase, but a matter of generating the idea in my own thinking env. My style, My thoughts, the wiki should be filled with these aromas of mine.
******* para, code, image
since it's a Herman's work, I shall choose medias I like.
******* Base: xv6 with mit lectures.
There's differences, but I think I would tell in the end
******* TODO D1: MIT6.S082 Week 1-3
******** TODO 1: Unix util
****** TODO Blog 
******* TODO Export
1. use a fnisessen's setup.
2. use a directory to hold all imgs for this wiki
******* TODO Deploy
1. Copy this wiki to org-website. and all the imgs into resource.
2. commit.
****** TODO experiance
Do all the labs from MITOCW schedule pages. Record them, what have I done, into blog.

***** [[id:6E68E676-98FD-429F-9A2A-7C3B2BF64D02][CPT102 Data Structures]]
****** goal 
******* note wiki
******* exported blog
******* experiance
Implementing the data structures and algorithms myself
****** TODO Wiki implement
Entries in [[id:6E68E676-98FD-429F-9A2A-7C3B2BF64D02][CPT102 Data Structures#wiki]].
******* Important: Written by Herman
It's not a matter of paraphrase, but a matter of generating the idea in my own thinking env. My style, My thoughts, the wiki should be filled with these aromas of mine.
******* para, code, image
since it's a Herman's work, I shall choose medias I like.
****** TODO Blog 
******* TODO Export
1. use a fnisessen's setup.
2. use a directory to hold all imgs for this wiki
******* TODO Deploy
1. Copy this wiki to org-website. and all the imgs into resource.
2. commit.
****** TODO experiance
******* TODO Implementing all data stuctures
Implement towards the wiki. Write the code on my own, define snippet when find them useful.

Illustrate them in the wiki.
******* TODO Implement the algorithms with the data structures.
follow wiki
***** [[id:D68B8A59-F6B6-4224-9801-FB1D061C07BE][INT102]]
****** goal 
******* note wiki
all algorithms stuffs and dependencies explained by Herman
******* exported blog
******* experiance
Implementing the data structures and algorithms myself, using c, java and clojure
****** TODO Wiki implement
****** TODO Blog
******* TODO Large file export to website
***** [[id:0A261A32-82AD-469F-94C4-2A512ACDB1C5][INT104 AI]]

****** goal

******* note wiki
all mentioned basic ideas explained by herman
understand the ideas with math involved
******* exported blog

******* experiance
coding with packages that achieves my goal.

******* CW1 and CW2
do the CW1 and CW2 up to day's process

****** TODO wiki implement
******* all the jargons
A word I don't know? An Entry in Wiki!
Math Math MAth!!!!
******* DONE 1.build [[id:69E6B0B6-9288-4467-8313-E729306A51DC][Artificial Intelligence]] page
CLOSED: [2022-04-23 Sat 14:56]
:LOGBOOK:
- State "DONE"       from "TODO"       [2022-04-23 Sat 14:56]
:END:
build the page

******* DONE 2. Inbox the...JARGONS
CLOSED: [2022-04-23 Sat 19:04]
:LOGBOOK:
- State "DONE"       from "TODO"       [2022-04-23 Sat 19:04]
CLOCK: [2022-04-23 Sat 18:27]--[2022-04-23 Sat 19:04] =>  0:37
:END:
from the lectur slides first, then book I have.
I'm working on =knowing what's out there, the range, the names= so I don't go into explaination, just spot important/structural/unfamilliar words, and heading them done
******** lecture

******** oops!
I steped into details. Not a good move in the stage, I messed the levels.
sol: exit details, inputing the...... =JARGONS!!!!!=

******* TODO 3. Starting from the Math Prerequisites.
******** TODO Linear Algebra
:LOGBOOK:
CLOCK: [2022-04-26 Tue 18:18]--[2022-04-26 Tue 20:27] =>  2:09
CLOCK: [2022-04-26 Tue 16:14]--[2022-04-26 Tue 17:12] =>  0:58
CLOCK: [2022-04-25 Mon 19:28]--[2022-04-25 Mon 20:17] =>  0:49
CLOCK: [2022-04-24 Sun 17:23]--[2022-04-24 Sun 17:53] =>  0:30
CLOCK: [2022-04-24 Sun 11:14]--[2022-04-24 Sun 13:22] =>  2:08
CLOCK: [2022-04-24 Sun 09:35]--[2022-04-24 Sun 10:11] =>  0:36
CLOCK: [2022-04-23 Sat 19:51]--[2022-04-23 Sat 20:22] =>  0:31
CLOCK: [2022-04-23 Sat 19:08]--[2022-04-23 Sat 19:28] =>  0:20
:END:
building org-roam page [[id:164D4757-5345-4355-BEAE-03F5E060E897][Linear Algebra]]
******** TODO Probability
****** TODO Blog
****** TODO Experiance
******* TODO Using
use =sklearn= to get a hint of what all the things look like
******* TODO Implementing
after knowing the math, I could write the funcitons myself. I could write some clojrue machine learning code.

I could build a Github repo for that. Named: =hermanhel/clml=
****** TODO Cw1 and Cw2
Read the task sheet again and confirm the project machine.
***** [[id:14467081-3CB3-44C4-9C4F-3FE83AACDE60][SPA003]]

****** goal

******* sentence library
all seen interesting/useful sentences
******* grammer library
all mentioned grammers explained/exampled by Herman
******* vocabulary library
****** TODO Sentence sweep
sweep sentences from past
****** TODO sentence capture
build capture machine
****** TODO grammer wiki
****** TODO vocabulary wiki
both in the spanish.org.
***** scale
It's 8 weeks content reviewed and rewrited in 2 weeks, so every week is assigned 4 weeks of content, each course. And there's 5 of them. so it's 20 week*course/week = 3 week*course/day.

So each day I should get at least 3 weeks of 1 class's content right. I guess that'll leave space for get better, keep good or other plans like fitness.


*** get better
Read and learn things I love so much
+ AOC
+ Neuroscience papers
+ AI papers
+ GIT
+ C
+ Java
+ clojure
**** TODO AOC
***** TODO Read Volumn 1.
****** TODO Personal Wiki
****** TODO Experiance
****** TODO blogging
**** TODO Math

*** keep good
after I have become good, a machine of keep good should be established and practiced in regard of every course's context

**** Keep up machine

***** Basic idea: Be good in small scale
but when the chunk is small, the overhead cost might be too great, so any sign of that should be fixed.
* Fun fact

** my dream

*** 企鹅
我进入一个房间,里面有一只企鹅.它看见我之后就一直来追我.
我吓坏了,就跑.房间是一个连续的区域,贯穿三楼,下了两层楼之后从一楼的出口出来.但是企鹅也出来了.女生A在一楼看见我之后追上我,问我为什么跑,我对A说明企鹅的情况.我们遂逐渐接近了高楼层.我们的目的地教室在很高的楼层,有复杂的路径,比如正经过的这一段有平行的两条路通向一远一近两个楼楼梯,之后远的能到达我们的教室.

但是企鹅还是追上了.我之后牵着它的手,和A一起上到楼上

*** 潜水艇
我们要进入教室时经历了第一个场景扭曲.保留了进入的动作,教室成为了潜水艇,我们进入的入口成为一个极其危险的处所,与入口前有一个两米长,一米宽的洞,洞的对面是一个像是树干内部的管道,直径约八十公分,皆通向极虚无而寒冷的不知名处,而入口在树干的上方(不确定).进入的办法是从我们所在的地方(变成了一个不定的木头平台,像是支点在不远处的后方的一个跷跷板)下到右侧的一个突起,沿着前往入口.

我和企鹅之前是A和另外一个小男孩.A小心地把小男孩放到突起上,他去树干里看了一眼,之后进入入口.A在他之后,我把企鹅也放了下去.它很害怕地但也进入了入口.这时我背后的高大男生B举着一个小女孩说,下一个让她进吧.高大男生在放小女孩下去之后,自己也进去了.我终于要下去的时候.

*** 秋游
第二个场景扭曲保留了我所在的入口和目的地的潜水艇,将不知名处变成了水汔,将所在的高处变为了学校秋游或是夏令营常见的一个户外处所.我很努力地尝试进入入口,但是突然一切坍塌了,原来是活动的时间结束,下一个使用场地的足球活动已经进场,有三个吹着哨子的管理女老师进入又出去.我想和她们说话,她们说她们什么都不知道.我看见有应一同进入,且应已在里面的同学走过,想去问里面的情况,他们笑,但不与我交流,其中包括三位一起住在一个消防队里(仅在夏令营时)的同学.原来上一次其中的一位也是住在消防队的,他以工作交换了住宿.这一次他带了两位另外的同学.

我接着前往了另一个地方,但是是全裸仅除了有一个前列腺按摩仪.我把它塞到后庭之内,然后前去.回来时在路上碰见了我爸妈和另外一对爸妈.我随他们进入一个房间,是大家聚会的房间.我想要回住所着装,遂前去.出门时我打开了按摩仪的开关.我大幅度地奔跑,而按摩仪毫无脱落的迹象,前列腺的紧迫感很快加剧,遂高潮,其射液起三米,而持续少时.我看到一只跳一人高而动作浮夸的青蛙,其准备动作似乎要鼓到炸开一般.

我在道路旁的一个园地希望关掉按摩仪,但是关不掉,长按只加剧震动,遂射液不止.我抽其出来,发现多了一套按钮.

*** 后来.
我醒过来.发现内裤湿了.看来确实高潮了.我听见楼下吹落叶的声音嗡嗡嗡,可能这是按摩仪声音的来源

* Drawing and Music are similar
If I wait, and try & asking, "is it sound like this?" I'll finally make the piece I imagined
if I rush, though I know all the components, I still could make the shape twisted and not ideal, to not generally good.

* A section as a movie
Should watch in a continuous time, before forgetting the names, plots, and relationships.

* 大脑神经化学变化

** miscellaneous

*** 高季染色法

*** 神经调质 NEuromodulator
dark enrgy of nervous system, inferred but not measured
**** 

*** 发展新的技术

**** 从已有方法的缺点中
需要有好的灵敏度,特异性
时空分辨率: spatial resolution
非损伤性:活的大脑
temporal resolution

***** microdialysis
慢

***** amperometry &FSCV
fast, 

***** CPCR based FRET-sensors
遗传编码,打荧光,但是基本看不到,信噪比不够

***** Tango assay
放大荧光
**** 从交叉学科手段
**** 希望有光学信号
**** 即蛋白酶
**** 结构生物学
**** beta-2
**** 配体结合导致构像变化,发光
在有机化合物分子中，由C—C单键旋转而产生的原子或基团在空间排列的无数特定的形象称为构象。
指一个分子中，不改变共价键结构，仅单键周围的原子放置所产生的空间排布。
**** 大麻素
利用人的内源大麻素系统产生作用
**** 2-AG, AEA
思考：AEA和2-AG的区别是什么？
**** 2-花生四烯酰甘油(2-AG) 是最有效和最丰富的内源性CB
**** 具体可查一下癫痫诱导的模型，一般分急性和慢性诱导
**** :无法解析新突触神经元形成产生的存储，当然够他们研究一辈子。
**** 现在有谷氨酸的探针么，没查到 用的细菌周质蛋白，不同的策略
**** 催产素有助于克服社交羞涩感，培养社交能力。social reward
**** imaging
**** SST
**** two-photon imaging 

* I like my life to be
听听报告,读读paper,做做实验,写写程序,挺好的.
再弹弹琴,画画画,写写文章,日子不要太美.
